{"data_set_description":{"id":"43903","name":"Diabetes-130-Hospitals_(Fairlearn)","version":"2","description":"The \"Diabetes 130-Hospitals\" dataset represents 10 years of clinical care at 130 U.S. hospitals and delivery networks, collected from 1999 to 2008. Each record represents the hospital admission record for a patient diagnosed with diabetes whose stay lasted between one to fourteen days. The features describing each encounter include demographics, diagnoses, diabetic medications, number of visits in the year preceding the encounter, and payer information, as well as whether the patient was readmitted after release, and whether the readmission occurred within 30 days of the release.\n\nThe original \"Diabetes 130-Hospitals\" dataset was collected by Beata Strack, Jonathan P. DeShazo, Chris Gennings, Juan L. Olmo, Sebastian Ventura, Krzysztof J. Cios, and John N. Clore in 2014.\n\nThis version of the dataset was derived by the Fairlearn team for the SciPy 2021 tutorial \"Fairness in AI Systems: From social context to practice using Fairlearn\". In this version, the target variable \"readmitted\" is binarized into whether the patient was re-admitted within thirty days. The full dataset pre-processing script can be found on GitHub: https:\/\/github.com\/fairlearn\/talks\/blob\/main\/2021_scipy_tutorial\/preprocess.py","description_version":"1","format":"arff","creator":"Beata Strack, Jonathan P. DeShazo, Chris Jennings, Juan L. Olmo, Sebastian Ventura, Krzysztof J. Cios, John N. Clore","collection_date":"05-03-2014","upload_date":"2022-06-01T10:32:44","language":"English","licence":"CC BY","url":"https:\/\/api.openml.org\/data\/v1\/download\/22102813\/Diabetes-130-Hospitals_(Fairlearn).arff","parquet_url":"http:\/\/openml1.win.tue.nl\/dataset43903\/dataset_43903.pq","file_id":"22102813","default_target_attribute":"readmit_30_days","citation":"Beata Strack, Jonathan P. DeShazo, Chris Gennings, Juan L. Olmo, Sebastian Ventura, Krzysztof J. Cios, and John N. Clore, Impact of HbA1c Measurement on Hospital Readmission Rates: Analysis of 70,000 Clinical Database Patient Records, BioMed Research International, vol. 2014, Article ID 781670, 11 pages, 2014.","visibility":"public","original_data_url":"https:\/\/archive.ics.uci.edu\/ml\/datasets\/Diabetes+130-US+hospitals+for+years+1999-2008","minio_url":"http:\/\/openml1.win.tue.nl\/dataset43903\/dataset_43903.pq","status":"active","processing_date":"2022-06-01 10:33:05","md5_checksum":"591e966373ea0acf0eb2c4ac833c3570"}}